import { locale as _locale } from '../zh-CN/content'

export const locale: typeof _locale = {
  chooseLang: 'अर्को भाषा छान्नुहोस्',
  standalone: 'सलाडिक्ट स्ट्यान्डअलोन प्यानल',
  fetchLangList: 'पूर्ण भाषा सूची तान्नुहोस्',
  transContext: 'पुनः अनुवाद गर्नुहोस्',
  neverShow: 'देखाउन रोक्नुहोस्',
  fromSaladict: 'सलाडिक्ट प्यानलबाट',
  tip: {
    historyBack: 'अघिल्लो खोज इतिहास',
    historyNext: 'पछिल्लो खोज इतिहास',
    searchText: 'पाठ खोज्नुहोस्',
    openOptions: 'विकल्प खोल्नुहोस्',
    addToNotebook: 'नोटबुकमा जोड्नुहोस्। नोटबुक खोल्न राइट क्लिक गर्नुहोस्',
    openNotebook: 'नोटबुक खोल्नुहोस्',
    openHistory: 'इतिहास खोल्नुहोस्',
    shareImg: 'तस्विर रूपमा साझा गर्नुहोस्',
    pinPanel: 'प्यानल पिन गर्नुहोस्',
    closePanel: 'प्यानल बन्द गर्नुहोस्',
    sidebar: 'साइडबार मोडमा स्विच गर्नुहोस्। दायाँ तर्फ दायाँ क्लिक गर्नुहोस्।',
    focusPanel: 'खोज गर्दा प्यानलले फोकस गर्ने',
    unfocusPanel: 'खोज गर्दा प्यानलले फोकस नगर्ने'
  },
  wordEditor: {
    title: 'नोटबुकमा जोड्नुहोस्',
    wordCardsTitle: 'नोटबुकबाट अन्य परिणामहरू',
    deleteConfirm: 'नोटबुकबाट हटाउनुहोस्?',
    closeConfirm: 'परिवर्तनहरू सुरक्षित हुँदैनन्। के तपाईँ बन्द गर्न चाहानुहुन्छ?',
    chooseCtxTitle: 'अनुवाद गरिएको परिणामहरू छान्नुहोस्',
    ctxHelp:
      'अनुवाद छान्न र एन्की तालिका उत्पन्न गर्न सलाडिकलाई निर्देशन गर्न यदि तपाईँले [:: xxx ::] र --------------- ढाँचा राख्न चाहानुहुन्छ भने।'
  },
  machineTrans: {
    switch: 'भाषा बदल्नुहोस्',
    sl: 'स्रोत भाषा',
    tl: 'लक्षित भाषा',
    auto: 'भाषा पत्ता लगाउनुहोस्',
    stext: 'सक्कल',
    showSl: 'सोर्स देखाउनुहोस्',
    copySrc: 'स्रोत कपि गर्नुहोस्',
    copyTrans: 'अनुवाद कपि गर्नुहोस्',
    login: 'कृपया {एसेस टोकन्} प्रदान गर्नुहोस्।',
    dictAccount: 'एसेस टोकन्'
  },
  updateAnki: {
    title: 'एन्कीमा अद्यावधिक गर्नुहोस्',
    success: 'शब्द एन्कीमा सफलतापूर्वक अद्यावधिक गरियो।',
    failed: 'शब्द एन्कीमा अद्यावधिक गर्न असफल भयो।'
  }
}
